weekend_blog_lab-master/app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @author = Author.find(params[:author_id])

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @author = Author.find(params[:author_id])